In [1]:
import numpy as np
import pandas as pd

In [5]:
Ad = pd.DataFrame({'Age': [25,18,9,13,34,15,22,17,12,37,15]})

In [6]:
Ad

    Age
0    25
1    18
2     9
3    13
4    34
5    15
6    22
7    17
8    12
9    37
10   15

In [22]:
Ad.sort_values(by = ['Age'])

    Age
2     9
8    12
3    13
5    15
10   15
7    17
1    18
6    22
0    25
4    34
9    37

In [7]:
Ad.count()

Age    11
dtype: int64

In [15]:
print("High school",
      Ad [(Ad['Age'] > 14) &
         (Ad ['Age']) < 18].count())

High school Age    11
dtype: int64

In [16]:
bin = Ad['Age'].value_counts()

15    2
25    1
18    1
9     1
13    1
34    1
22    1
17    1
12    1
37    1
Name: Age, dtype: int64

In [26]:
bin = Ad['Age'].value_counts()

In [27]:
Ad

    Age
0    25
1    18
2     9
3    13
4    34
5    15
6    22
7    17
8    12
9    37
10   15

In [37]:
hs = Ad.query("Age >= 14 & Age <= 18")
hs.head()

    Age
1    18
5    15
7    17
10   15

In [58]:
hsc = hs.count()

In [59]:
hsc

Age    4
dtype: int64

In [60]:
nhs = Ad.count() - hs.count()

In [61]:
nhs

Age    7
dtype: int64

In [64]:
print((nhs/Ad.count())*100)

Age    63.636364
dtype: float64